/**
 * 保存一些跨项目的常量配置
 *
 */

exports.failCode = {
	// node端错误 3100开头
	"3100": "未知错误。",
	"3101": "返回为空。",
	"3102": "返回的不是一个对象。",
	"3104": "账号信息异常。",
	
	// java端错误 3200开头或自定义
	"8500": "TOKEN NOT FOUND。",
	"8501": "TOKEN未知错误。",
	// TOKEN已过期 分两种情况：1是token过期，2是refreshToken过期
	"8502": "TOKEN已过期，请重新登录。",
	"8503": "TOKEN签名错误或包含非法字符。",
	"8504": "不支持的TOKEN格式。",
	"8505": "无效的TOKEN格式。",
	
	// vue权限错误 3000开头
	"3000": "未知错误",
	"3001": "未获取到用户信息，请登录！", // token获取失败
	"3002": "token失效",
	"3003": "token过期",
	"3004": "token刷新失败",
	"3005": "刷新token再次获取数据时，依然提示token失败",
	"3006": "session获取失败",
	"3007": "session格式错误",
	"3008": "用户信息获取失败",
	"3009": "无法获取用户角色权限",
	"3010": "该角色无权限访问",
	"3011": "账号信息异常",
	"3012": "使用游客账号登录失败",
	"3013": "获取UserInfo失败",
	"3014": "您没有访问该终端类型的权限",
	
	// 其它
	"400": "请求错误",
	"500": "后台错误"
};
